var baseUrl = 'http://112.19.171.231:8080/fests/';
//var baseUrl = 'http://192.168.1.213:9080/fests/';

const CONFIG = {
	cookieKey: 'user',
	page: {
		size: 10,
		total: 101,
	},
	api: {
		testUrl: baseUrl + 'comcenter/replylist.do', //测试
	},
	ajaxCount: 0,
	success: {
		"1": "加载数据成功",
		'101': "注册成功",
		'102': "",
		'103': "",
		'104': "已退出",
		'105': "",
		'106': "注册成功"
	},
	error: {
		'-1': '加载数据失败，请检查网络！',
		'-1010': '手机号码不能为空！',
		'-1011': '手机号码不正确！',
		'-1012': '获取验证码失败！',
		'-1020': '邮箱不能为空！',
		'-1021': '邮箱不正确！',
		'-1022': '获取验证码失败！',
		'-1030': '至少选中一条数据！',
		'-1040': '',
		'-1050': '非法操作！',
		'-1060': '注册失败'
	}
}

export default CONFIG